{
    "jobs": [
        {
            "Role": "Design Team Member",
            "Division": "Design",
            "Leadership": "No",
            "Description": "The design team member will use their creative skills to make graphics for things such as HackMerced stickers, T-Shirts, and logos.  Will also work with the marketing team. Additionally, will use their creative skills to make graphics and mock ups for an elegant website design.",
            "Requirements": [
                "Can think out side the box",
                "Portfolio of past designs",
            ],
            "Optional": [
                "Adobe Illustrator, Photoshop, etc"
            ]
        },
        {
            "Role": "Director of Logistics",
            "Division": "Logistics",
            "Leadership": "Yes",
            "Description": "The logistics director will work with various departments within HackMerced to book venues, develop and run schedules, and order services and supplies. Will also hold the role of Volunteer Manager which will have the responsibility of recruiting, managing and educating potential volunteers for HackMerced events.",
            "Requirements": [
                "Must be flexible and able to solve unexpected tasks",
                "Multitasking",
                "Experienced with documented work",
                "Experience in talking with OSL",
                "Experience in using room reservation software",
                "Experience in event planning outside UC Merced"
            ],
            "Optional": [
                "Students with connections to other universities, including student, staff and faculty"
            ]
        },
        {
            "Role": "Logistics Team Member",
            "Division": "Logistics",
            "Leadership": "No",
            "Description": "The logistics team member will work along-side the logistics director to coordinate, plan and create events at UC Merced and the Merced community. Additionally, they will work to create, organize, and run non-hackathon HackMerced related events. They are self-guided with support from the director of HackMerced and from the logistics director to successfully hold events both during and outside the hackathon. These events can be anything from workshops, mini-hackathons, main event, speaks/talks, info sessions, tabling, etc.",
            "Requirements": [
                "Experience in throwing events at UC Merced",
                "Must be flexible and able to solve unexpected tasks",
                "Multitasking"
            ],
            "Optional": [
                "Experience in talking with OSL",
                "Experience in using room reservation software",
                "Experience in event planning outside UC Merced",
                "Experienced with documented work"
            ]
        },
        {
            "Role": "Director of Finance",
            "Division": "Finance",
            "Leadership": "Yes",
            "Description": "The director of finance will help secure sponsorships, make sure vendors get paid, and manage the cash flow and budget. Will also be required to handle all requests with ASUCM, ICC, OSL, and Vanguard.",
            "Requirements": [
                "Manages budget and controls expenses effectively.",
                "Ethical Conduct",
                "Strategic Thinking",
                "Experienced with Excel/Google spreadsheets",
                "Worked in a financial-related position before"
            ],
            "Optional": [
                "Good social skills",
                "Solid math background",
                "Experience in budgeting Experience in working at a club at UCM as a Treasurer"
            ]
        },
        {
            "Role": "Finance Team Member",
            "Division": "Finance",
            "Leadership": "No",
            "Description": "The finance team member will help secure sponsorships, make sure vendors get paid, and manage the cash flow and budget. May represent the Finance Director at a ASUCM, ICC, OSL, and Vanguard meeting. Additionally, they will predict trends in spending and growth. Build budgets for events as well as locate areas to cut costs and research new ways to efficiently spend money.",
            "Requirements": [
                "Manages budget and controls expenses effectively.",
                "Ethical Conduct",
                "Strategic Thinking"
            ],
            "Optional": [
                "Worked in a financial-related position before",
                "Solid math background"
            ]
        },
        {
            "Role": "Director of Marketing",
            "Division": "Marketing",
            "Leadership": "Yes",
            "Description": "The Director of Marketing will be planning and coordinating marketing campaigns for HackMerced, that can include emails, social media posts, blogs, and video. They also work with the Logistics team to build and create non-primary Hackathon events.",
            "Requirements": [
                "Proficient and independent in drafting up e-mails in a professional environment",
                "Excellent Writing and Communication skills",
                "Students with connections to other universities, including student, staff and faculty",
                "Responds to emails in a timely manner"
            ],
            "Optional": [
                "Has a blog, medium, or publishes content online ",
                "Has done social media management in the past",
                "Has written email campaigns"
            ]
        },
        {
            "Role": "Marketing Team Member",
            "Division": "Marketing",
            "Leadership": "No",
            "Description": "The marketing team member will work with students from other schools to establish the HackMerced brand at their respective campuses. Will work to produce captivating marketing strategies for HackMerced. Will produce emails for HackMerced that will inform students about HackMerced’s events and activities. They will work with the Marketing Director to make interesting and informative posts for HackMerced as well as communicate and interact with the HackMerced community online.",
            "Requirements": [
                "Proficient and independent in drafting up e-mails",
                "Excellent writing skills",
                "Experience with Facebook, Instagram, and Twitter"
            ],
            "Optional": [
                "Has a blog, medium, or publishes content online ",
                "Has done social media management in the past",
                "Has written email campaigns",
                "Has writing portfolio with published articles, social media marketing presence"
            ]
        },
        {
            "Role": "Director of Engineering",
            "Division": "Engineering",
            "Leadership": "Yes",
            "Description": "Director of Engineering position will be in charge of the engineering team and leading them to create new software and features. Will also be in charge of building the HackMerced site and creating a place for people to apply for our event. Will have the freedom to work on other projects and delegate out to team members.",
            "Requirements": [
                "Proficiency in one of the following: Javascript, C/C++, Java",
                "Experience in MVC ecosystems (React, Angular, Vue)",
                "Knowledgeable with servers and databases"
            ],
            "Optional": [
                "Open source contributor",
                "Preferred 3rd+ year, but not required",
                "Proficiency with Git"
            ]
        },
        {
            "Role": "Engineering Team Member",
            "Division": "Engineering",
            "Leadership": "No",
            "Description": "The engineering team member position will allow one to stretch their skills to build applications in the following fields webdev, hardware, devops, mobile development. Will be in working in a team to create new software and features. Additionally, they will work with the design and marketing teams to push HackMerced's brand.",
            "Requirements": [
                "Proficiency in one of the following: Javascript, C/C++, Java",
                "Willing to learn and work on a team"
            ],
            "Optional": [
                "Proficiency in HTML, CSS, python",
                "Proficiency with React.js",
                "Proficiency with servers",
                "Proficiency with databases",
                "Proficiency with Git"
            ]
        }
    ]
}
